{
  "movies":[
  
    {
      "title": "Plane",
      "year": 2023,
      "cast": [
        "Gerard Butler",
        "Mike Colter",
        "Yoson An",
        "Tony Goldwyn"
      ],
      "genres": [
        "Action",
        "Thriller"
      ],
      "href": "Plane_(film)",
      "extract": "Plane is a 2023 American action thriller film directed by Jean-François Richet from a screenplay by Charles Cumming and J. P. Davis. The film stars Gerard Butler, Mike Colter, Yoson An, and Tony Goldwyn. The plot centers on a pilot (Butler) allying with a prisoner (Colter) to save his passengers from a hostile territory they landed in for an emergency landing.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/d/d2/Plane_%282023_film%29_poster.png",
      "thumbnail_width": 250,
      "thumbnail_height": 370,
      "trailer":"video trailers/Plane (2023 Movie) Final Trailer – Gerard Butler, Mike Colter, Yoson An.mp4"
    },
   
    {
      "title": "Mafia Mamma",
      "year": 2023,
      "cast": [
        "Toni Collette",
        "Monica Bellucci",
        "Sophia Nomvete",
        "Rob Huebel"
      ],
      "genres": [
        "Action",
        "Comedy"
      ],
      "href": "Mafia_Mamma",
      "extract": "Mafia Mamma is an upcoming American action comedy film directed by Catherine Hardwicke, from a screenplay by Michael J. Feldman and Debbie Jhoon, and based on an original story by Amanda Sthers. It stars Toni Collette as an American woman who travels to Italy following the death of her grandfather, who she finds out was a mafia Don. Monica Bellucci and Sophia Nomvete also star.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/4/48/Mafia_mamma_film.png",
      "thumbnail_width": 255,
      "thumbnail_height": 378,
      "trailer":"video trailers/mafia-mamma-trailer-1-2023_video_720p.mp4"
    },
   
    {
      "title": "Extraction 2",
      "year": 2023,
      "cast": [
        "Chris Hemsworth",
        "Golshifteh Farahani",
        "Adam Bessa",
        "Daniel Bernhardt",
        "Tinatin Dalakishvili"
      ],
      "genres": [
        "Action",
        "Thriller"
      ],
      "href": "Extraction_2",
      "extract": "Extraction 2 is an upcoming American action thriller film directed by Sam Hargrave and written by Joe Russo, based on the graphic novel Ciudad by Ande Parks, Joe Russo, Anthony Russo, Fernando León González, and Eric Skillman. A sequel to the 2020 film, Chris Hemsworth, Golshifteh Farahani and Adam Bessa reprise their roles, with Olga Kurylenko, Daniel Bernhardt and Tinatin Dalakishvili joining the cast.",
      "trailer":"video trailers/extraction-2-official-trailer-netflix_video_720p.mp4"
    },
    {
      "title": "The Blackening",
      "year": 2023,
      "cast": [
        "Grace Byers",
        "Jermaine Fowler",
        "Melvin Gregg",
        "X Mayo",
        "Dewayne Perkins",
        "Antoinette Robertson",
        "Sinqua Walls",
        "Jay Pharoah",
        "Yvonne Orji"
      ],
      "genres": [
        "Comedy",
        "Horror"
      ],
      "href": "The_Blackening_(film)",
      "extract": "The Blackening is a 2022 American comedy horror film directed by Tim Story and co-written by Tracy Oliver and Dewayne Perkins, who also stars. Expanded from a 2018 short film by the improv comedy troupe 3Peat, the film follows an all-Black group of friends who encounter a killer while staying at a cabin in the woods.",
      "thumbnail": "https://cdn.cinematerial.com/p/136x/l8yw5b5w/extraction-2-movie-poster-sm.jpg",
      "thumbnail_width": 255,
      "thumbnail_height": 319,
      "trailer":"video trailers/the-blackening-2023-official-trailer-grace-byers-jermaine-fowler-melvin-gregg-x-mayo_video_720p.mp4"
    },
    {
      "title": "No Hard Feelings",
      "year": 2023,
      "cast": [
        "Jennifer Lawrence",
        "Andrew Barth Feldman",
        "Laura Benanti",
        "Natalie Morales",
        "Matthew Broderick"
      ],
      "genres": [
        "Comedy",
        "Teen",
        "Erotic"
      ],
      "href": "No_Hard_Feelings_(2023_film)",
      "extract": "No Hard Feelings is an upcoming American coming of age sex comedy film directed by Gene Stupnitsky from a screenplay he co-wrote with John Phillips. Jennifer Lawrence produces and stars alongside Andrew Barth Feldman. Appearing in supporting roles are Matthew Broderick, Laura Benanti, Natalie Morales, Scott MacArthur and Ebon Moss-Bachrach.",
      "trailer":"video trailers/no-hard-feelings-trailer-2023-jennifer-lawrence-comedy-movie_video_720p.mp4"
    },
    {
      "title": "The Perfect Find",
      "year": 2023,
      "cast": [
        "Gabrielle Union",
        "Keith Powers",
        "Gina Torres",
        "Ts Madison"
      ],
      "genres": [
        "Comedy",
        "Romance"
      ],
      "href": "The_Perfect_Find",
      "extract": "The Perfect Find is an upcoming American romantic comedy film written by Leigh Davenport and directed by Numa Perrier. It is based on the book of the same name by Tia Williams. The film stars Gina Torres, Keith Powers, and Gabrielle Union, who is also a co-producer.",
      "trailer": "video trailers/the-perfect-find-trailer-2023-gabrielle-union-romantic-movie_video_720p.mp4"
    },
   
    {
      "title": "Teenage Mutant Ninja Turtles: Mutant Mayhem",
      "year": 2023,
      "cast": [
        "Nicolas Cantu",
        "Micah Abbey",
        "Shamon Brown Jr.",
        "Brady Noon",
        "Jackie Chan",
        "Ayo Edebiri",
        "Ice Cube",
        "Seth Rogen",
        "John Cena",
        "Hannibal Buress",
        "Rose Byrne",
        "Post Malone",
        "Paul Rudd",
        "Maya Rudolph",
        "Natasia Demetriou",
        "Giancarlo Esposito"
      ],
      "genres": [
        "Animated",
        "Superhero"
      ],
      "href": "Teenage_Mutant_Ninja_Turtles:_Mutant_Mayhem",
      "extract": "Teenage Mutant Ninja Turtles: Mutant Mayhem is an upcoming American computer-animated superhero film directed by Jeff Rowe and co-directed by Kyler Spears, from a screenplay written by Brendan O'Brien. Based on the characters created by Kevin Eastman and Peter Laird, it serves as a reboot of the Teenage Mutant Ninja Turtles film series. It is also the first theatrical animated feature based on the property since TMNT (2007). In the film, after years of being sheltered from the human world, four mutated turtle brothers—Leonardo, Michelangelo, Donatello, and Raphael —set out to be accepted as normal teenagers while taking on a mysterious crime syndicate and an army of mutants. The ensemble voice cast includes Jackie Chan, Ayo Edebiri, Ice Cube, Seth Rogen, John Cena, Paul Rudd, Natasia Demetriou, Rose Byrne, Post Malone, Hannibal Buress, Maya Rudolph, and Giancarlo Esposito.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/a/a2/Mutant_Mayhem_poster.jpeg",
      "thumbnail_width": 259,
      "thumbnail_height": 384,
      "trailer":"video trailers/teenage-mutant-ninja-turtles-mutant-mayhem-teaser-trailer-2023-movie-seth-rogen_video_720p.mp4"
    },
    
    {
      "title": "The Equalizer 3",
      "year": 2023,
      "cast": [
        "Denzel Washington",
        "Dakota Fanning"
      ],
      "genres": [
        "Action"
      ],
      "href": "The_Equalizer_3",
      "extract": "The Equalizer 3 is an upcoming American vigilante action film directed by Antoine Fuqua. It is the sequel to the 2018 film The Equalizer 2, which was based on the TV series of the same name. The film stars Denzel Washington, Dakota Fanning, Sonia Ammar and Remo Girone. Washington and Fanning reuniting on-screen for the first time since 2004's Man on Fire. It follows retired U.S. Marine and former CIA officer Robert McCall. The film is the fifth collaboration between Washington and Fuqua, following Training Day (2001), The Equalizer (2014), The Magnificent Seven (2016), and The Equalizer 2 (2018).",
      "trailer":"video trailers/the-equalizer-3-official-red-band-trailer-hd_video_720p.mp4"
    },
    {
      "title": "The Nun 2",
      "year": 2023,
      "cast": [
        "Storm Reid",
        "Taissa Farmiga",
        "Anna Popplewell"
      ],
      "genres": [
        "Horror",
        "Supernatural"
      ],
      "href": "The_Nun_2",
      "extract": "The Nun 2 is an upcoming American gothic supernatural horror film directed by Michael Chaves and written by Akela Cooper, Ian Goldberg, and Richard Naing from a story by Cooper. It serves as the sequel to The Nun (2018) and the ninth installment in The Conjuring Universe franchise. The film stars Storm Reid, Taissa Farmiga, and Anna Popplewell. Wan and Peter Safran return as co-producers, with Judson Scott also serving as a producer.",
      "trailer":"video trailers/the-nun-ii-official-trailer_video_720p.mp4"
    },
    
    {
      "title": "The Expendables 4",
      "year": 2023,
      "cast": [
        "Jason Statham",
        "50 Cent",
        "Megan Fox",
        "Dolph Lundgren",
        "Randy Couture",
        "Tony Jaa",
        "Iko Uwais",
        "Jacob Scipio",
        "Levy Tran",
        "Andy García",
        "Sylvester Stallone"
      ],
      "genres": [
        "Action"
      ],
      "href": "The_Expendables_4",
      "extract": "The Expendables 4 is an upcoming American action film directed by Scott Waugh, with a script co-written by Kurt Wimmer, Tad Daggerhart and Max Adams, from an original story by Kurt Wimmer, Spenser Cohen and Tad Daggerhart. It is the fourth installment in The Expendables franchise and the sequel to The Expendables 3 (2014), starring an ensemble cast including Jason Statham, Dolph Lundgren, Randy Couture, and Sylvester Stallone reprising their roles from previous films, alongside 50 Cent, Megan Fox, Andy García, Tony Jaa, Jacob Scipio, Iko Uwais, Levy Tran and Eddie Hall.",
      "trailer":"video trailers/expend4bles-2023-official-trailer-jason-statham-50-cent-megan-fox-dolph-lundgren_video_1080p.mp4"
    },
  
    {
      "title": "Kraven the Hunter",
      "year": 2023,
      "cast": [
        "Aaron Taylor-Johnson",
        "Ariana DeBose",
        "Alessandro Nivola",
        "Fred Hechinger",
        "Levi Miller",
        "Christopher Abbott",
        "Russell Crowe"
      ],
      "genres": [
        "Superhero"
      ],
      "href": "Kraven_the_Hunter_(film)",
      "extract": "Kraven the Hunter is an upcoming American superhero film based on the Marvel Comics character of the same name, produced by Columbia Pictures in association with Marvel. Distributed by Sony Pictures Releasing, it is intended to be the fourth film in Sony's Spider-Man Universe (SSU). The film is being directed by J. C. Chandor from a screenplay by Art Marcum & Matt Holloway and Richard Wenk, and stars Aaron Taylor-Johnson in the title role alongside Ariana DeBose and Fred Hechinger.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Kraven_the_Hunter_%28film%29.jpg/320px-Kraven_the_Hunter_%28film%29.jpg",
      "thumbnail_width": 320,
      "thumbnail_height": 107,
      "trailer":"video trailers/kraven-the-hunter-official-red-band-trailer-hd_video_480p.mp4"
    },
  
    {
      "title": "The Marvels",
      "year": 2023,
      "cast": [
        "Brie Larson",
        "Teyonah Parris",
        "Iman Vellani",
        "Zawe Ashton",
        "Samuel L. Jackson"
      ],
      "genres": [
        "Superhero"
      ],
      "href": "The_Marvels",
      "extract": "The Marvels is an upcoming American superhero film based on Marvel Comics featuring the characters Carol Danvers / Captain Marvel, Kamala Khan / Ms. Marvel, and Monica Rambeau. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is intended to be the sequel to the film Captain Marvel (2019), a continuation of the television series Ms. Marvel (2022), and the 33rd film in the Marvel Cinematic Universe (MCU). The film is directed by Nia DaCosta from a screenplay she co-wrote with Megan McDonnell, Elissa Karasik, and Zeb Wells. It stars Brie Larson as Carol Danvers, Iman Vellani as Kamala Khan, and Teyonah Parris as Monica Rambeau, alongside Samuel L. Jackson. In the film, Danvers, Khan, and Rambeau begin swapping places with each other every time they use their powers and must team-up.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/7/7a/The_Marvels_poster.jpg",
      "thumbnail_width": 259,
      "thumbnail_height": 384,
      "trailer":"video trailers/the-marvels-official-trailer-2023-brie-larson-teyonah-parris-iman-vellani_video_720p.mp4"
    },
    {
      "title": "Chicken Run: Dawn of the Nugget",
      "year": 2023,
      "cast": [
        "Zachary Levi",
        "Thandiwe Newton",
        "Bella Ramsey",
        "Romesh Ranganathan",
        "David Bradley",
        "Daniel Mays",
        "Jane Horrocks",
        "Imelda Staunton",
        "Lynn Ferguson",
        "Nick Mohammed"
      ],
      "genres": [
        "Adventure",
        "Animated",
        "Comedy"
      ],
      "href": "Chicken_Run:_Dawn_of_the_Nugget",
      "extract": "Chicken Run is a 2000 stop-motion animated adventure comedy film produced by Pathé and Aardman Animations in partnership with DreamWorks Animation. Aardman's first feature-length film, it was directed by Peter Lord and Nick Park from a screenplay by Karey Kirkpatrick and based on an original story by Lord and Park. The film stars the voices of Julia Sawalha, Mel Gibson, Tony Haygarth, Miranda Richardson, Phil Daniels, Lynn Ferguson, Timothy Spall, Imelda Staunton, and Benjamin Whitrow. The plot centres on a group of British anthropomorphic chickens who see an American rooster named Rocky Rhodes as their only hope to escape the farm when their owners want to turn them into meat pies.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/thumb/0/00/Chicken_run_ver1.jpg/320px-Chicken_run_ver1.jpg",
      "thumbnail_width": 320,
      "thumbnail_height": 228,
      "trailer":"video trailers/chicken-run-dawn-of-the-nugget-official-teaser-netflix_video_720p.mp4"
    },
    {
      "title": "The Killer",
      "year": 2023,
      "cast": [
        "Michael Fassbender",
        "Charles Parnell",
        "Arliss Howard",
        "Sophie Charlotte",
        "Tilda Swinton"
      ],
      "genres": [
        "Action",
        "Noir",
        "Thriller"
      ],
      "href": "The_Killer_(2023_film)",
      "extract": "The Killer is an upcoming American neo-noir action thriller film directed by David Fincher and with a screenplay by Andrew Kevin Walker. The film is based on the French graphic novel series of the same name by Alexis Nolent and Luc Jacamon. The film stars Michael Fassbender, Charles Parnell, Arliss Howard, Sophie Charlotte, and Tilda Swinton.",
      "trailer":"video trailers/the-killer-official-trailer-netflix_video_720p.mp4"
    },
    {
      "title": "The Holdovers",
      "year": 2023,
      "cast": [
        "Paul Giamatti",
        "Dominic Sessa",
        "Da'Vine Joy Randolph",
        "Carrie Preston"
      ],
      "genres": [
        "Comedy",
        "Drama"
      ],
      "href": "The_Holdovers",
      "extract": "The Holdovers is an upcoming American comedy-drama film directed by Alexander Payne, written by David Hemingson and starring Paul Giamatti.",
      "trailer":"video trailers/the-holdovers-official-trailer-hd-in-select-theaters-october-27-everywhere-november-10_video_720p.mp4"
    },
    {
      "title": "The Hunger Games: The Ballad of Songbirds and Snakes",
      "year": 2023,
      "cast": [
        "Tom Blyth",
        "Rachel Zegler",
        "Josh Andrés Rivera",
        "Hunter Schafer",
        "Jason Schwartzman",
        "Burn Gorman",
        "Peter Dinklage",
        "Viola Davis"
      ],
      "genres": [
        "Action",
        "Science Fiction"
      ],
      "href": "The_Hunger_Games:_The_Ballad_of_Songbirds_and_Snakes",
      "extract": "The Hunger Games: The Ballad of Songbirds and Snakes is an upcoming American science fiction action film directed by Francis Lawrence from a screenplay by Michael Arndt and Michael Lesslie, based on the 2020 novel The Ballad of Songbirds and Snakes by Suzanne Collins. It is the fifth installment in The Hunger Games film series, serving as a prequel to The Hunger Games (2012). The film stars Tom Blyth, Rachel Zegler, Josh Andrés Rivera, Hunter Schafer, Jason Schwartzman, Burn Gorman, Peter Dinklage, and Viola Davis. Set 64 years before the first film, it follows the origins of Coriolanus Snow (Blyth) and his relationship with a young Hunger Games tribute Lucy Gray Baird (Zegler), which lead him on the path to becoming the tyrannical leader of Panem.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/b5/Hunger_games_the_ballad_of_songbirds_and_snakes.png",
      "thumbnail_width": 255,
      "thumbnail_height": 393,
      "trailer":"video trailers/the-hunger-games-the-ballad-of-songbirds-snakes-2023-official-trailer_video_720p.mp4"
    },
    {
      "title": "Trolls Band Together",
      "year": 2023,
      "cast": [
        "Anna Kendrick",
        "Justin Timberlake",
        "Kenan Thompson",
        "Kunal Nayyar",
        "Camila Cabello",
        "Troye Sivan",
        "Kid Cudi",
        "Andrew Rannells",
        "Amy Schumer",
        "Daveed Diggs",
        "RuPaul",
        "Zosia Mamet"
      ],
      "genres": [
        "Animated",
        "Comedy",
        "Musical"
      ],
      "href": "Trolls_Band_Together",
      "extract": "Trolls Band Together is an upcoming American computer-animated musical comedy film produced by DreamWorks Animation and distributed by Universal Pictures, based on the Good Luck Trolls dolls from Thomas Dam. It is directed by Walt Dohrn and co-directed by Tim Heitz, from a screenplay by Elizabeth Tippet and the writing team of Jonathan Aibel and Glenn Berger. The film serves as the sequel to Trolls World Tour (2020) and the third installment in the Trolls franchise. Anna Kendrick, Justin Timberlake, Zooey Deschanel, Christopher Mintz-Plasse, Icona Pop, Anderson .Paak, Ron Funches, Kenan Thompson, Kunal Nayyar, and Dohrn reprise their voice roles from its predecessors, with newcomers Eric André, Kid Cudi, Daveed Diggs, Troye Sivan, Camila Cabello, Amy Schumer, Andrew Rannells, RuPaul, and Zosia Mamet joining the ensemble voice cast. In the film, Poppy (Kendrick) and Branch (Timberlake), who are officially a couple, attempt to rescue Floyd (Sivan) while reuniting Branch's brothers after the boyband phenomenon, BroZone, was disbanded.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/b/bd/Trolls3film.jpg",
      "thumbnail_width": 251,
      "thumbnail_height": 397,
      "trailer":"video trailers/trolls-band-together-official-trailer_video_816p.mp4"
    },
    {
      "title": "A Family Affair",
      "year": 2023,
      "cast": [
        "Nicole Kidman",
        "Zac Efron",
        "Joey King",
        "Liza Koshy",
        "Kathy Bates"
      ],
      "genres": [
        "Comedy",
        "Romance"
      ],
      "href": "A_Family_Affair_(2023_film)",
      "extract": "A Family Affair is an upcoming American romantic comedy film directed by Richard LaGravenese and written by Carrie Solomon. The film stars Nicole Kidman, Zac Efron, Joey King, Liza Koshy, and Kathy Bates.",
      "trailer":"video trailers/a-family-affair-official-trailer-netflix_video_720p.mp4"
    },
    {
      "title": "Thanksgiving",
      "year": 2023,
      "cast": [
        "Addison Rae",
        "Patrick Dempsey",
        "Gina Gershon"
      ],
      "genres": [
        "Slasher"
      ],
      "href": "Thanksgiving_(upcoming_film)",
      "extract": "Thanksgiving is an upcoming American slasher film directed by Eli Roth and produced by Roger Birnbaum, from a screenplay written by Roth and Jeff Rendell. It is based on Roth's mock trailer of the same name from Grindhouse (2007). The film stars Addison Rae and Patrick Dempsey.",
      "trailer":"video trailers/thanksgiving-official-trailer-hd_video_720p.mp4"
    },
    {
      "title": "Wish",
      "year": 2023,
      "cast": [
        "Ariana DeBose",
        "Alan Tudyk"
      ],
      "genres": [
        "Animated"
      ],
      "href": "List_of_Walt_Disney_Animation_Studios_films#Upcoming_films",
      "extract": "Walt Disney Animation Studios is an American animation studio headquartered in Burbank, California, the original feature film division of The Walt Disney Company. The studio's films are also often called \"Disney Classics\", or \"Disney Animated Canon\".",
      "trailer":"video trailers/wish-official-trailer_video_720p.mp4"
    },
    {
      "title": "Napoleon",
      "year": 2023,
      "cast": [
        "Joaquin Phoenix",
        "Vanessa Kirby",
        "Tahar Rahim"
      ],
      "genres": [
        "Drama",
        "Historical"
      ],
      "href": "Napoleon_(2023_film)",
      "extract": "Napoleon is an upcoming epic historical drama film directed and produced by Ridley Scott and written by David Scarpa. It stars Joaquin Phoenix as Napoleon and depicts the French leader's rise to power. The film is scheduled to be theatrically released by Sony Pictures Releasing on November 22, 2023, before streaming on Apple TV+ at a later date.",
      "trailer":"video trailers/napoleon-official-trailer-hd_video_720p.mp4"
    },
    {
      "title": "Leave the World Behind",
      "year": 2023,
      "cast": [
        "Julia Roberts",
        "Mahershala Ali",
        "Ethan Hawke",
        "Myha'la Herrold",
        "Farrah Mackenzie",
        "Charlie Evans",
        "Kevin Bacon"
      ],
      "genres": [
        "Thriller"
      ],
      "href": "Leave_the_World_Behind_(film)",
      "extract": "Leave the World Behind is an upcoming psychological thriller film written, directed and produced by Sam Esmail, based on the 2020 the novel of the same name by Rumaan Alam. The film stars Julia Roberts, Mahershala Ali, Ethan Hawke, Myha'la Herrold, Farrah Mackenzie, Charlie Evans, and Kevin Bacon.",
    "trailer":"video trailers/leave-the-world-behind-official-trailer-netflix_video_720p.mp4"  
    },
    {
      "title": "Magazine Dreams",
      "year": 2023,
      "cast": [
        "Jonathan Majors",
        "Haley Bennett",
        "Taylour Paige",
        "Mike O'Hearn",
        "Harrison Page",
        "Harriet Sansom Harris"
      ],
      "genres": [
        "Drama"
      ],
      "href": "Magazine_Dreams",
      "extract": "Magazine Dreams is a 2023 American drama film written and directed by Elijah Bynum. It stars Jonathan Majors, Haley Bennett, Taylour Paige, Mike O'Hearn, Harrison Page and Harriet Sansom Harris.",
      "trailer":"video trailers/magazine-dreams-release-date-trailer-cast-all-the-major-updates_video_720p.mp4"
    },
    {
      "title": "Wonka",
      "year": 2023,
      "cast": [
        "Timothée Chalamet",
        "Keegan-Michael Key",
        "Sally Hawkins",
        "Jim Carter",
        "Matt Lucas",
        "Natasha Rothwell",
        "Olivia Colman",
        "Rowan Atkinson"
      ],
      "genres": [
        "Fantasy",
        "Musical"
      ],
      "href": "Wonka_(film)",
      "extract": "Wonka is an upcoming musical fantasy film directed by Paul King, who co-wrote the screenplay with Simon Farnaby. The film serves as a prequel to the 1964 novel Charlie and the Chocolate Factory by Roald Dahl and stars Timothée Chalamet as the titular character, following his early days as an eccentric chocolatier. Keegan-Michael Key, Rowan Atkinson, Sally Hawkins, Olivia Colman, and Jim Carter star in supporting roles.",
      "trailer":"video trailers/wonka-trailer-2_video_720p.mp4"
    },
    {
      "title": "Aquaman and the Lost Kingdom",
      "year": 2023,
      "cast": [
        "Jason Momoa",
        "Amber Heard",
        "Willem Dafoe",
        "Patrick Wilson",
        "Dolph Lundgren",
        "Yahya Abdul-Mateen II",
        "Temuera Morrison",
        "Nicole Kidman"
      ],
      "genres": [
        "Superhero"
      ],
      "href": "Aquaman_and_the_Lost_Kingdom",
      "extract": "Aquaman and the Lost Kingdom is an upcoming American superhero film based on the DC Comics character Aquaman. Produced by DC Studios, the Safran Company, and Atomic Monster Productions, and set for distribution by Warner Bros. Pictures, it is intended to be the sequel to Aquaman (2018), and the 15th and final installment in the DC Extended Universe (DCEU). The film is directed by James Wan from a screenplay written by David Leslie Johnson-McGoldrick, and stars Jason Momoa as Arthur Curry / Aquaman alongside Amber Heard, Willem Dafoe, Patrick Wilson, Dolph Lundgren, Yahya Abdul-Mateen II, Temuera Morrison, and Nicole Kidman.",
      "thumbnail": "https://upload.wikimedia.org/wikipedia/en/thumb/f/f9/Aquaman_and_the_Lost_Kingdom_logo.jpg/320px-Aquaman_and_the_Lost_Kingdom_logo.jpg",
      "thumbnail_width": 320,
      "thumbnail_height": 163,
      "trailer":"video trailers/aquaman-and-the-lost-kingdom-new-trailer_video_720p.mp4"
    },
    {
      "title": "Untitled Ghostbusters: Afterlife sequel",
      "year": 2023,
      "cast": [
        "Mckenna Grace",
        "Carrie Coon",
        "Finn Wolfhard",
        "Paul Rudd",
        "Celeste O'Connor",
        "Logan Kim",
        "Bill Murray",
        "Dan Aykroyd",
        "Ernie Hudson",
        "Sigourney Weaver",
        "Annie Potts",
        "Patton Oswalt",
        "Kumail Nanjiani"
      ],
      "genres": [
        "Comedy",
        "Supernatural"
      ],
      "href": "Untitled_Ghostbusters:_Afterlife_sequel",
      "extract": "The untitled Ghostbusters: Afterlife sequel is an upcoming American supernatural comedy film directed by Gil Kenan from a screenplay co-written by Jason Reitman and Kenan. It serves as the sequel to Ghostbusters: Afterlife (2021), and the fifth film in the Ghostbusters franchise. The film stars Finn Wolfhard, Mckenna Grace, Celeste O'Connor, Carrie Coon, Paul Rudd and Ernie Hudson reprising their roles, with new additions to the cast including Kumail Nanjiani, Patton Oswalt, James Acaster and Emily Alyn Lind.",
      "trailer":"video trailers/ghostbusters-frozen-empire-official-teaser-trailer-hd_video_720p.mp4"
    },
    {
      "title": "Rebel Moon",
      "year": 2023,
      "cast": [
        "Sofia Boutella",
        "Charlie Hunnam",
        "Ray Fisher",
        "Djimon Hounsou",
        "Jena Malone",
        "Corey Stoll",
        "Ed Skrein",
        "Cleopatra Coleman",
        "Fra Fee",
        "Cary Elwes",
        "Anthony Hopkins"
      ],
      "genres": [
        "Science Fiction"
      ],
      "href": "Rebel_Moon",
      "extract": "Rebel Moon is an upcoming American epic space opera film directed by Zack Snyder from a screenplay he co-wrote with Shay Hatten and Kurt Johnstad, based on a story he also created with Johnstad. Produced by The Stone Quarry and Grand Electric, and distributed by Netflix. The film features an ensemble cast that includes Sofia Boutella, Charlie Hunnam, Ray Fisher, Djimon Hounsou, Jena Malone, Corey Stoll, Ed Skrein, Cleopatra Coleman, Fra Fee, Cary Elwes, and Anthony Hopkins.",
      "trailer":"video trailers/rebel-moon-part-one-a-child-of-fire-official-trailer-netflix_video_720p.mp4"
    },
    {
      "title": "The Color Purple",
      "year": 2023,
      "cast": [
        "Fantasia Barrino",
        "Colman Domingo",
        "Corey Hawkins",
        "Danielle Brooks",
        "H.E.R.",
        "Halle Bailey",
        "Ciara",
        "Aunjanue Ellis",
        "Deon Cole",
        "Elizabeth Marvel",
        "Jon Batiste",
        "Louis Gossett Jr.",
        "David Alan Grier",
        "Taraji P. Henson"
      ],
      "genres": [
        "Drama",
        "Musical",
        "Historical"
      ],
      "href": "The_Color_Purple_(2023_film)",
      "extract": "The Color Purple is an upcoming American musical coming-of-age period drama film directed by Blitz Bazawule and adapted for the screen by Marcus Gardley from the 2005 stage musical of the same name, which is in turn based on Alice Walker's 1982 Pulitzer Prize-winning novel of the same name. It is the second film adaptation of the novel, following Steven Spielberg's 1985 film adaptation. Spielberg and Quincy Jones return to produce this version, along with the stage musical's producers Scott Sanders and Oprah Winfrey, the latter of whom also starred in the 1985 film as Sofia.",
      "trailer":"video trailers/the-color-purple-official-trailer_video_720p.mp4"
    }
  ]
}
